RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/uart_reg.h
    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : urx_bcr_int_cfg */
    union {
        struct {
            uint32_t cr_urx_bcr_value  : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t sts_urx_bcr_count : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_bcr_int_cfg;

    /* 0x54 : utx_rs485_cfg */
    union {
        struct {
            uint32_t cr_utx_rs485_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_utx_rs485_pol : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } utx_rs485_cfg;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[40];

    /* 0x80 : uart_fifo_config_0 */
    union {
        struct {
            uint32_t uart_dma_tx_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t uart_dma_rx_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_config_0;

    /* 0x84 : uart_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 6; /* [ 5: 0],          r,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 6; /* [13: 8],          r,        0x0 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 5; /* [20:16],        r/w,        0x0 */
            uint32_t reserved_21_23 : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 5; /* [28:24],        r/w,        0x0 */
            uint32_t reserved_29_31 : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_config_1;

    /* 0x88 : uart_fifo_wdata */
    union {
        struct {
            uint32_t uart_fifo_wdata : 8;  /* [ 7: 0],          w,          x */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_wdata;

    /* 0x8C : uart_fifo_rdata */
    union {
        struct {
            uint32_t uart_fifo_rdata : 8;  /* [ 7: 0],          r,        0x0 */
            uint32_t reserved_8_31   : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_fifo_rdata;
};

typedef volatile struct uart_reg uart_reg_t;

#endif /* __UART_REG_H__ */
